USE asp;
----------------------------------------------------------------------------------
--插入地点信息--
--插入省份名称
INSERT INTO 省份代码表 (省份名称) VALUES ('湖北');
--插入城市信息
--湖北省
INSERT INTO 城市代码表 (城市名称) VALUES ('武汉');
--插入区信息
--武汉市
INSERT INTO 区代码表 (区名称) VALUES ('洪山区');
--插入街道名称
--洪山区
INSERT INTO 街道代码表 (街道名称) VALUES ('雄楚大街');
--插入邮政编码
INSERT INTO 邮政编码代码表 (邮政编码) VALUES ('430076');
INSERT INTO 邮政编码代码表 (邮政编码) VALUES ('430074');
INSERT INTO 邮政编码代码表 (邮政编码) VALUES ('430075');
INSERT INTO 邮政编码代码表 (邮政编码) VALUES ('430000');
----------------------------------------------------------------------------------

----------------------------------------------------------------------------------
--插入学校信息相关--
--插入院系名称
INSERT INTO 院系代码表 (院系名称) VALUES ('计算机与信息工程学院');
--插入专业名称
INSERT INTO 专业代码表 (专业名称) VALUES ('软件工程产业计划');
--插入班级信息
INSERT INTO 班级代码表 (班级名称) VALUES ('软件工程产业计划');
--插入教室信息
INSERT INTO 教室代码表 (教室名称) VALUES ('教3-101');
----------------------------------------------------------------------------------

----------------------------------------------------------------------------------
--插入个人信息相关--
--插入户籍信息
INSERT INTO 户籍代码表 (户籍名称) VALUES ('农村户口');
INSERT INTO 户籍代码表 (户籍名称) VALUES ('非农村户口');
--插入婚配信息
INSERT INTO 婚配代码表 (婚配情况) VALUES ('已婚');
INSERT INTO 婚配代码表 (婚配情况) VALUES ('未婚');
--插入身份信息
INSERT INTO 身份代码表 (身份名称) VALUES ('学生');
INSERT INTO 身份代码表 (身份名称) VALUES ('教师');
INSERT INTO 身份代码表 (身份名称) VALUES ('管理员');
--插入身份证类别信息
INSERT INTO 身份证类别代码表 (身份证类别名称) VALUES ('身份证');
--插入性别信息
INSERT INTO 性别代码表 (性别) VALUES ('男');
INSERT INTO 性别代码表 (性别) VALUES ('女');
INSERT INTO 性别代码表 (性别) VALUES ('男转女');
INSERT INTO 性别代码表 (性别) VALUES ('女转男');
INSERT INTO 性别代码表 (性别) VALUES ('中性');
INSERT INTO 性别代码表 (性别) VALUES ('未鉴定');
--插入政治身份信息
INSERT INTO 政治面貌代码表 (政治面貌类型) VALUES ('少年先锋队队员');
INSERT INTO 政治面貌代码表 (政治面貌类型) VALUES ('共产党青年团团员');
INSERT INTO 政治面貌代码表 (政治面貌类型) VALUES ('中国共产党党员');
--插入民族信息
INSERT INTO 民族代码表 (民族名称) VALUES ('汉族');
-----------------------------------------------------------------------------------

-----------------------------------------------------------------------------------
--插入课程相关信息：
--课程开始节数
INSERT INTO 课程开始节数表 VALUES (1);
--课程上课星期
INSERT INTO 课程上课星期表 VALUES (1);
--课程所在学期
INSERT INTO 课程所在学期表 VALUES (1);
------------------------------------------------------------------------------------

------------------------------------------------------------------------------------
--插入审核相关信息
--插入审核状态
INSERT INTO 审核状态代码表 (审核状态) VALUES ('已通过');
INSERT INTO 审核状态代码表 (审核状态) VALUES ('待审核');
INSERT INTO 审核状态代码表 (审核状态) VALUES ('暂缓保留');
--插入是否需要材料
INSERT INTO 是否需要材料代码表 (是否需要材料) VALUES ('是');
INSERT INTO 是否需要材料代码表 (是否需要材料) VALUES ('否');
------------------------------------------------------------------------------------

------------------------------------------------------------------------------------
--插入学籍学位信息--
--插入学位信息
INSERT INTO 学位代码表 (学位名称) VALUES (''); -- ？？？
--插入学习层次信息
INSERT INTO 学习层次代码表 (学习层次) VALUES ('本科');
INSERT INTO 学习层次代码表 (学习层次) VALUES ('专科');
INSERT INTO 学习层次代码表 (学习层次) VALUES ('研究生');
INSERT INTO 学习层次代码表 (学习层次) VALUES ('硕士');
INSERT INTO 学习层次代码表 (学习层次) VALUES ('博士');
INSERT INTO 学习层次代码表 (学习层次) VALUES ('博士后');
------------------------------------------------------------------------------------